## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                    NAME                     |
|----------|---------------------------------------------|
| update   | `aws_iam_policy.quicksight-s3-usage`        |
|          | `aws_quicksight_data_set.login_events`      |
|          | `aws_quicksight_data_source.rds`            |
| recreate | `aws_quicksight_vpc_connection.rds`         |
| add      | `aws_iam_policy.quicksight-s3-restricted`   |
|          | `aws_quicksight_data_set.sms_usage`         |
|          | `aws_quicksight_refresh_schedule.sms_usage` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.quicksight-s3-restricted will be created
  + resource "aws_iam_policy" "quicksight-s3-restricted" {
      + arn         = (known after apply)
      + description = "Allow access to S3"
      + id          = (known after apply)
      + name        = "s3-usage-restricted"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-sms-usage-west-2-logs",
                          + "arn:aws:s3:::notification-canada-ca-staging-sms-usage-logs",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-sms-usage-west-2-logs/*",
                          + "arn:aws:s3:::notification-canada-ca-staging-sms-usage-logs/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.quicksight-s3-usage will be updated in-place
  ~ resource "aws_iam_policy" "quicksight-s3-usage" {
        id          = "arn:aws:iam::239043911459:policy/s3-usage"
        name        = "s3-usage"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "s3:ListBucketMultipartUploads",
                          + "s3:*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_quicksight_data_set.login_events will be updated in-place
  ~ resource "aws_quicksight_data_set" "login_events" {
        id             = "239043911459,login-events"
        name           = "Login Events"
        tags           = {}
        # (6 unchanged attributes hidden)

      - refresh_properties {
          - refresh_configuration {
              - incremental_refresh {
                  - lookback_window {
                      - column_name = "created_at" -> null
                      - size        = 1 -> null
                      - size_unit   = "DAY" -> null
                    }
                }
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_quicksight_data_set.sms_usage will be created
  + resource "aws_quicksight_data_set" "sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms_usage"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "SmsUsage"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "smsusage"

          + s3_source {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/s3-sms-usage"

              + input_columns {
                  + name = "PublishTimeUTC"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "MessageId"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "MessageType"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "DeliveryStatus"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "PriceInUSD"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "PartNumber"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "TotalParts"
                  + type = "INTEGER"
                }

              + upload_settings {
                  + contains_header = true
                  + delimiter       = ","
                  + format          = "CSV"
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
    }

  # aws_quicksight_data_source.rds will be updated in-place
  ~ resource "aws_quicksight_data_source" "rds" {
        id             = "239043911459/NotificationCanadaCastaging"
        name           = "Quicksight RDS data source"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ vpc_connection_properties {
          ~ vpc_connection_arn = "arn:aws:quicksight:ca-central-1:239043911459:vpcConnection/vpc-097508d1f5e243195" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_quicksight_refresh_schedule.sms_usage will be created
  + resource "aws_quicksight_refresh_schedule" "sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms_usage"
      + id             = (known after apply)
      + schedule_id    = "schedule-sms-usage"

      + schedule {
          + refresh_type          = "INCREMENTAL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "02:30"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_vpc_connection.rds must be replaced
-/+ resource "aws_quicksight_vpc_connection" "rds" {
      ~ arn                 = "arn:aws:quicksight:ca-central-1:239043911459:vpcConnection/vpc-097508d1f5e243195" -> (known after apply)
      ~ availability_status = "AVAILABLE" -> (known after apply)
      ~ aws_account_id      = "239043911459" -> (known after apply)
      ~ id                  = "239043911459,vpc-097508d1f5e243195" -> (known after apply)
      ~ name                = "Quicksight RDS connection" -> "Quicksight RDS connection TEMP"
      ~ vpc_connection_id   = "vpc-097508d1f5e243195" -> "quicksight-rds-vpc-connection" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-restricted"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
